# Завдання на роботу зі словниками

# 1. Телефонний довідник:
# Створити словник, де ключами є імена людей, а значеннями - їхні номери телефонів.
# Додати новий контакт до телефонного довідника.
# Знайти номер телефону за ім'ям.


# 2. Підрахунок літер:

# Створити словник, де ключами є літери, а значеннями - їхні кількості у рядку.
# Знайти кількість вказаних літер у заданому рядку.

# 3. Робота з цінами товарів:

# Створити словник, де ключами є назви товарів, а значеннями - їхні ціни.
# Знайти ціну товару за його назвою.
# Додати новий товар та його ціну до словника.


# 4. Співставлення даних:
# Створити два словники з іменами та віками людей.
# Знайти вік особи за її ім'ям.
# Співставити дані із двох словників та створити загальний словник з іменами та віками.

dict1 = {
    'Ivan': 20,
    'Petro': 30,
    'Sasha': 32
}

dict2 = {
    'Anna': 27,
    'Nastya': 30,
    'Alina': 45
}

# dict1_copy = dict1.copy()

# dict1_copy.update(dict2)

# print(dict1_copy)
# print(dict1)

# dict1_copy = dict1

# dict1_copy['Ivan'] = 40

# print(dict1)

# common_dict = {}


# common_dict.update(dict1)
# common_dict.update(dict2)

# print(common_dict)
# print(dict1)


# 5. Вартість покупок:

# Створити словник з назвами товарів та їхніми цінами.
# Створити список покупок та розрахувати загальну вартість.

# goods = {
#     'pen': 20,
#     'pencil': 15,
#     'paper': 10
# }

# order = [('pen', 2), ('paper', 15), ('pencil', 1)]
# sum = 0

# for element in order:
#     sum += goods[element[0]] * element[1]

# print(sum)

# 6. Рейтинг учнів:

# Створити словник з іменами учнів і їхніми оцінками.
# Знайти середній бал усіх учнів.

# students = {
#     'Anna': 10,
#     'Ivan': 11,
#     'Nastya': 9,
#     'Petro': 10
# }

# sum = 0

# for studentKey in students:
#     sum += students[studentKey]

# print(sum/len(students))