# 1. Ви - настирливий продавець і коли хтось відвідує ваш сайт онлайн-магазину, 
# ви запитуєте 5 разів у користувача, чи потрібно йому передзвонити. 
# На 6-ий раз ви нарешті лишаєте покупця в спокої і бажаєте йому гарних покупок.


# for i in range(5):
#     inp = input('Чи потрібно вам передзвонити?')

#     if(inp == 'y' or i == 4):
#         print('Have a nice day')
#         break




# 2. Ви - власник онлайн магазину канцтоварів. Кожному 3-му покупцю ви обіцяєте 
# в подарунок ручку до замовлення, а кожному 5-му - лінійку.

# *розгляньте випадок, коли покупець може бути і 3-ій і 5-им (75-ий покупець, до прикладу).
# *для проходження по всій кількості покупців використайте range() ф-ю в циклі for. 

# Кількість покупців ви можете задати вручну, або скористатись ф-єю input() і ввести к-сть з терміналу
# *Додайте функціонал на випадок, якщо користувач промахнувся по клавіатурі і ввів замість числа
# якусь абракадабру (ф-я isdigit())

# customers_amount = input('Введіть кількість покупців: ')

# for i in range(customers_amount ):

#     if customers_amount.isdigit():
#          print('Ви ввели неправильну кількість покупців')
#          break
    
#     customer_index = i + 1

#     if customer_index % 3 == 0 and customer_index % 5 !=0:
#         print('Ви отримали у подарунок РУЧКУ')
#     elif customer_index % 3 != 0  and customer_index % 5 == 0:
#          print('Ви отримали у подарунок ЛІНІЙКУ')
#     else:
#           print('Пощастить наступного разу!')
        
    


# 3. Створіть програму, яка перевіряє, чи має користувач достатньо коштів на банківському рахунку 
# для здійснення покупки. Питайте у користувача суму покупки та його залишок на рахунку. Виведіть 
# повідомлення про результат перевірки.

customer_purchase = int(input('Введіть суму вашої покупки: '))
customer_balance = int(input('Введіть залишок на вашому рахунку: '))

if customer_purchase > customer_balance:
    print('Недостатньо коштів')
else:
     print('Покупка оплачена')
