# 1. Створіть програму для керування списком замовлень в ресторані. 
# Кожне замовлення має містити ім'я клієнта, страви та їх кількість. 
# Реалізуйте можливість додавання нових замовлень, видалення замовлень 
# та виведення загального рахунку за замовлення.

# orders = [
#     ['Ivan', [['Potatos', 2, 50], ['Meat', 1, 70], ['Salad', 1, 45]]]
# ]

# orders.append(['Anna', [['Salad', 1, 45]]])
# # orders.pop(0)
# # print(orders)

# for order in orders:
#     total_sum = 0

#     for dish in order[1]:
#         total_sum += dish[1] * dish[2]

#     print(total_sum)



# 2. Створіть програму для організації опитування користувачів. 
# Зберіть відповіді користувачів у списку (Як варіант, в кінці 
# можете вивести суто унікальні відповіді користувачів)


# 3. Напишіть програму, яка допомагає управляти списком контактів. 
# Кожен контакт має містити ім'я та номер телефону. Реалізуйте можливість 
# додавання, видалення та пошуку контактів за ім'ям або номером телефону.

# 4.Розробіть програму для керування запасами товарів в магазині. Кожен товар 
# представляється словником, який містить назву товару, його ціну та кількість на складі.
# Додайте функції для додавання нових товарів, продажу товарів та відображення 
# загальної вартості товарів на складі.


# str_c = [1, 3].extend([9, 27])

# print(str_c)
# print([1, 3] + [9, 27])

print(('four', ) * 4)